In [2]:
# Initialize the workspace
from pymongo import MongoClient
import pprint
import pandas as pd
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

In [3]:
client = MongoClient()

In [4]:
db = client['eia_data']

In [5]:
oil_produced = db['oil_produced']
natural_gas_produced = db['natural_gas_produced']
natural_gas_flared = db['natural_gas_flared']

In [6]:
oil_produced.count_documents({})

1

In [9]:
df_op = pd.DataFrame(oil_produced.find())
df_op.tail()

,_id,us,padd 1,florida,new york,pennsylvania,virginia,west virginia,padd 2,illinois,...,utah,wyoming,padd 5,alaska,south alaska,north slope,arizona,california,nevada,federal offshore (padd 5)
0,5f160f4e58a8943a3c5bd8e1,"[, , , , , , , , , 2, 500, 2,114, 3,057, 2,611...","[, 42,829, 34,018, 28,282, 23,142, 20,961, 17,...","[, 34,773, 25,626, 19,476, 14,462, 11,458, 9,3...","[, 841, 834, 831, 840, 1,071, 853, 710, 566, 4...","[, 3,729, 4,282, 4,282, 4,284, 4,851, 3,783, 3...","[, 13, 49, 65, 32, 26, 18, 17, 25, 23, 16, 13,...","[, 3,473, 3,227, 3,628, 3,524, 3,555, 3,145, 2...","[, 355,653, 372,436, 378,879, 393,759, 384,082...","[, 24,090, 27,710, 29,200, 28,868, 30,265, 27,...",...,"[, 25,860, 22,440, 29,534, 34,689, 40,792, 39,...","[, 130,563, 118,300, 118,303, 124,269, 128,514...","[, 973,352, 1,021,430, 1,031,262, 1,044,543, 1...","[, 587,337, 618,910, 625,527, 630,401, 666,233...","[, 31,072, 27,404, 24,769, 21,983, 16,946, 17,...","[, 556,265, 591,506, 600,758, 608,418, 649,287...","[, 357, 335, 237, 215, 175, 161, 131, 113, 137...","[, 365,370, 373,176, 374,161, 381,621, 394,002...","[, 700, 613, 810, 1,907, 3,039, 2,907, 3,112, ...","[, 19,588, 28,396, 30,527, 30,399, 29,875, 28,..."

In [11]:
df_ngp = pd.DataFrame(natural_gas_produced.find())
df_ngp.head()

,_id,us,us offshore,us state offshore,federal offshore us,alaska,alaska onshore,alaska offshore,alaska state offshore,arkansas,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
0,5f160fe558a8943a3c5bd8e2,"[, , , , , , 2,691,512, 3,084,567, 3,108,858, ...","[, , , , , , , 3,932,196, 5,111,413, 5,603,025...","[, , , , , , , , 755,671, 780,911, 747,743, 70...","[, , , , , , , 3,932,196, 4,355,742, 4,822,114...","[, , , , , , , 65,817, 99,303, 149,647, 217,85...","[, , 2,409,336, 2,545,144, 2,861,599, 3,256,35...","[, , , , , , , , 72,813, 71,946, 63,355, 71,47...","[, , , , , , , , 72,813, 71,946, 63,355, 71,47...","[, , , , , , , 127,529, 162,155, 175,335, 183,...",...,"[, , , , , , , 43,092, 43,930, 38,690, 40,038,...","[, , , , , , , 181,309, 171,617, 168,714, 157,...","[, , , , , , , 0, 0, 0, 0, 22, 9, 33, 33, 30, ...","[, , , , , , , 10,082, 9,329, 7,416, 6,309, 5,...","[, 53, 30, 21, 16, 13, 11, 9, 9, 8, 7, 7, 6, 6...","[, , , , , , , 3,837, 4,632, 4,861, 3,358, 2,2...","[, , , , , , , , , 2, 5, 5, 3, 3, 2,790, 4,080...","[, , , , , , , 0, 0, 0, 0, 9, 8, 10, 48, 39, 5...","[, , , , , , , 0, 0, 0, 0, 497, 205, 185, 393,...","[, , , , , , , 3,818, 3,389, 2,846, 2,805, 2,6..."

In [13]:
df_ngf = pd.DataFrame(natural_gas_flared.find())
df_ngf.head()

,_id,us,alaska,alaska onshore,alaska state offshore,arkansas,california,california onshore,california state offshore,federal offshore california,...,michigan,mississippi,missouri,nebraska,nevada,new york,oregon,south dakota,tennessee,virginia
0,5f16106358a8943a3c5bd8e3,"[, , , , , , 392,528, 526,159, 649,106, 677,31...","[, , , , , , , 11,390, 24,258, 32,543, 34,808,...","[, , 9,481, 11,262, 8,733, 7,105, 5,942, 6,401...","[, , 4,616, 11,224, 4,507, 1,631, 1,128, 1,868...","[, , , , , , , 997, 895, 1,326, 226, 1,734, 2,...","[, , , , , , , 3,565, 2,780, 3,074, 2,499, 575...","[, , 751, 580, 830, 1,250, 1,268, 1,590, 1,952...","[, , , 0, NA, NA, NA, NA, 0, 0, 0, 0, NA, NA, ...","[, , , 0, NA, NA, , , , , , , NA, , NA, NA, , ...",...,"[, , , , , , , 1,861, 1,120, 808, 809, , 1,032...","[, , , , , , , 7,098, 5,910, 8,097, 7,233, 5,0...","[, , , , , , , 0, NA, NA, NA, NA, NA, 0, 0, 0,...","[, , , , , , , 0, 0, 0, 0, 1,558, 1,263, 834, ...","[, 0, , , , , , , , , , , , , , 0, 0, 0, 0, 0,...","[, , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0...","[, , , , , , -, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...","[, , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 4, 5, 5...","[, , , , , , , 0, 0, 0, 0, 408, 180, 165, 376,...","[, , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0..."